In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
Series = pd.Series({1: 'Mayar', 2:'Ali', 3:'Turki' })
s = pd.Series(Series)

## Q2: Change indexes to 11, 12, 13.

In [3]:
s.index = [11, 12, 13]

## Q3: Retrieve First and second elements.

In [4]:
print(s[:2])

11    Mayar
12      Ali
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [5]:
s1 = pd.Series({14: 'Turki', 15: 'Ali'})
s = s.append(s1)
s.drop_duplicates()

/var/folders/s6/z0592sm57wz2qf_8572ccxb40000gn/T/ipykernel_78104/264963740.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s = s.append(s1)

11    Mayar
12      Ali
13    Turki
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [6]:
students = {'ID': [876864, 84754, 654635, 35475],
        'Name': ['Norah', 'Hala', 'Fai', 'yara'],
        'GPA': [4.85, 4.5, 3.9, 2.5],}


df = pd.DataFrame(students, columns=['ID', 'Name', 'GPA'])
df

       ID   Name   GPA
0  876864  Norah  4.85
1   84754   Hala  4.50
2  654635    Fai  3.90
3   35475   yara  2.50

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [7]:
educ= pd.read_csv('/Users/norah/Downloads/educ_figdp_1_Data.csv')
educ.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [9]:
''' In Q1 we created a series and later we changed the index from 1,2,3 to 11,12,13 
when we used slicing we had to use the position however with loc we used the index labels '''
s[0:3]
s.loc[11:13]

11    Mayar
12      Ali
13    Turki
dtype: object